import {
  type CodePoint,
  type CodePointSet,
  isControl,
  isDiacritic,
  isLinebreak,
  isWhitespace,
  toCodePoints,
} from "@keybr/unicode";

const basicLettersData = [
  [
    [/* A */ 0x0041],
    [
      /* À */ 0x00c0, /* Á */ 0x00c1, /* Â */ 0x00c2, /* Ã */ 0x00c3,
      /* Ä */ 0x00c4, /* Å */ 0x00c5, /* Ā */ 0x0100, /* Ă */ 0x0102,
      /* Ą */ 0x0104, /* Ǎ */ 0x01cd, /* Ǟ */ 0x01de, /* Ǡ */ 0x01e0,
      /* Ǻ */ 0x01fa, /* Ȁ */ 0x0200, /* Ȃ */ 0x0202, /* Ȧ */ 0x0226,
      /* Ⱥ */ 0x023a, /* Ḁ */ 0x1e00, /* Ạ */ 0x1ea0, /* Ả */ 0x1ea2,
      /* Ấ */ 0x1ea4, /* Ầ */ 0x1ea6, /* Ẩ */ 0x1ea8, /* Ẫ */ 0x1eaa,
      /* Ậ */ 0x1eac, /* Ắ */ 0x1eae, /* Ằ */ 0x1eb0, /* Ẳ */ 0x1eb2,
      /* Ẵ */ 0x1eb4, /* Ặ */ 0x1eb6, /* Ⓐ */ 0x24b6, /* Ɐ */ 0x2c6f,
      /* Ａ */ 0xff21,
    ],
  ],
  [[/* A */ 0x0041, /* A */ 0x0041], [/* Ꜳ */ 0xa732]],
  [
    [/* A */ 0x0041, /* E */ 0x0045],
    [/* Æ */ 0x00c6, /* Ǣ */ 0x01e2, /* Ǽ */ 0x01fc],
  ],
  [[/* A */ 0x0041, /* O */ 0x004f], [/* Ꜵ */ 0xa734]],
  [[/* A */ 0x0041, /* U */ 0x0055], [/* Ꜷ */ 0xa736]],
  [
    [/* A */ 0x0041, /* V */ 0x0056],
    [/* Ꜹ */ 0xa738, /* Ꜻ */ 0xa73a],
  ],
  [[/* A */ 0x0041, /* Y */ 0x0059], [/* Ꜽ */ 0xa73c]],
  [
    [/* B */ 0x0042],
    [
      /* Ɓ */ 0x0181, /* Ƀ */ 0x0243, /* Ḃ */ 0x1e02, /* Ḅ */ 0x1e04,
      /* Ḇ */ 0x1e06, /* Ⓑ */ 0x24b7, /* Ｂ */ 0xff22,
    ],
  ],
  [
    [/* C */ 0x0043],
    [
      /* C */ 0x0043, /* Ç */ 0x00c7, /* Ć */ 0x0106, /* Ĉ */ 0x0108,
      /* Ċ */ 0x010a, /* Č */ 0x010c, /* Ƈ */ 0x0187, /* Ȼ */ 0x023b,
      /* Ḉ */ 0x1e08, /* Ⓒ */ 0x24b8, /* Ꜿ */ 0xa73e, /* Ｃ */ 0xff23,
    ],
  ],
  [
    [/* D */ 0x0044],
    [
      /* Ď */ 0x010e, /* Đ */ 0x0110, /* Ɖ */ 0x0189, /* Ɗ */ 0x018a,
      /* ᴅ */ 0x1d05, /* Ḋ */ 0x1e0a, /* Ḍ */ 0x1e0c, /* Ḏ */ 0x1e0e,
      /* Ḑ */ 0x1e10, /* Ḓ */ 0x1e12, /* Ⓓ */ 0x24b9, /* Ꝺ */ 0xa779,
      /* Ｄ */ 0xff24,
    ],
  ],
  [
    [/* D */ 0x0044, /* Z */ 0x005a],
    [/* Ǆ */ 0x01c4, /* Ǳ */ 0x01f1],
  ],
  [[/* D */ 0x0044, /* h */ 0x0068], [/* Ð */ 0x00d0]],
  [
    [/* D */ 0x0044, /* z */ 0x007a],
    [/* ǅ */ 0x01c5, /* ǲ */ 0x01f2],
  ],
  [
    [/* E */ 0x0045],
    [
      /* È */ 0x00c8, /* É */ 0x00c9, /* Ê */ 0x00ca, /* Ë */ 0x00cb,
      /* Ē */ 0x0112, /* Ĕ */ 0x0114, /* Ė */ 0x0116, /* Ę */ 0x0118,
      /* Ě */ 0x011a, /* Ǝ */ 0x018e, /* Ɛ */ 0x0190, /* Ȅ */ 0x0204,
      /* Ȇ */ 0x0206, /* Ȩ */ 0x0228, /* ɛ */ 0x025b, /* ᴇ */ 0x1d07,
      /* Ḕ */ 0x1e14, /* Ḗ */ 0x1e16, /* Ḙ */ 0x1e18, /* Ḛ */ 0x1e1a,
      /* Ḝ */ 0x1e1c, /* Ẹ */ 0x1eb8, /* Ẻ */ 0x1eba, /* Ẽ */ 0x1ebc,
      /* Ế */ 0x1ebe, /* Ề */ 0x1ec0, /* Ể */ 0x1ec2, /* Ễ */ 0x1ec4,
      /* Ệ */ 0x1ec6, /* Ⓔ */ 0x24ba, /* Ｅ */ 0xff25,
    ],
  ],
  [
    [/* F */ 0x0046],
    [
      /* Ƒ */ 0x0191, /* Ḟ */ 0x1e1e, /* Ⓕ */ 0x24bb, /* Ꝼ */ 0xa77b,
      /* ꝼ */ 0xa77c, /* Ｆ */ 0xff26,
    ],
  ],
  [
    [/* G */ 0x0047],
    [
      /* Ĝ */ 0x011c, /* Ğ */ 0x011e, /* Ġ */ 0x0120, /* Ģ */ 0x0122,
      /* Ɠ */ 0x0193, /* Ǥ */ 0x01e4, /* Ǧ */ 0x01e6, /* Ǵ */ 0x01f4,
      /* ɢ */ 0x0262, /* Ḡ */ 0x1e20, /* Ⓖ */ 0x24bc, /* Ᵹ */ 0xa77d,
      /* Ꝿ */ 0xa77e, /* Ꞡ */ 0xa7a0, /* Ｇ */ 0xff27,
    ],
  ],
  [
    [/* H */ 0x0048],
    [
      /* Ĥ */ 0x0124, /* Ħ */ 0x0126, /* Ȟ */ 0x021e, /* Ḣ */ 0x1e22,
      /* Ḥ */ 0x1e24, /* Ḧ */ 0x1e26, /* Ḩ */ 0x1e28, /* Ḫ */ 0x1e2a,
      /* Ⓗ */ 0x24bd, /* Ⱨ */ 0x2c67, /* Ⱶ */ 0x2c75, /* Ɥ */ 0xa78d,
      /* Ｈ */ 0xff28,
    ],
  ],
  [
    [/* I */ 0x0049],
    [
      /* Ì */ 0x00cc, /* Í */ 0x00cd, /* Î */ 0x00ce, /* Ï */ 0x00cf,
      /* Ĩ */ 0x0128, /* Ī */ 0x012a, /* Ĭ */ 0x012c, /* Į */ 0x012e,
      /* İ */ 0x0130, /* Ɨ */ 0x0197, /* Ǐ */ 0x01cf, /* Ȉ */ 0x0208,
      /* Ȋ */ 0x020a, /* Ḭ */ 0x1e2c, /* Ḯ */ 0x1e2e, /* Ỉ */ 0x1ec8,
      /* Ị */ 0x1eca, /* Ⓘ */ 0x24be, /* Ｉ */ 0xff29,
    ],
  ],
  [
    [/* J */ 0x004a],
    [
      /* Ĵ */ 0x0134, /* ȷ */ 0x0237, /* Ɉ */ 0x0248, /* Ⓙ */ 0x24bf,
      /* Ｊ */ 0xff2a,
    ],
  ],
  [
    [/* K */ 0x004b],
    [
      /* Ķ */ 0x0136, /* Ƙ */ 0x0198, /* Ǩ */ 0x01e8, /* Ḱ */ 0x1e30,
      /* Ḳ */ 0x1e32, /* Ḵ */ 0x1e34, /* Ⓚ */ 0x24c0, /* Ⱪ */ 0x2c69,
      /* Ꝁ */ 0xa740, /* Ꝃ */ 0xa742, /* Ꝅ */ 0xa744, /* Ꞣ */ 0xa7a2,
      /* Ｋ */ 0xff2b,
    ],
  ],
  [
    [/* L */ 0x004c],
    [
      /* Ĺ */ 0x0139, /* Ļ */ 0x013b, /* Ľ */ 0x013d, /* Ŀ */ 0x013f,
      /* Ł */ 0x0141, /* Ƚ */ 0x023d, /* Ḷ */ 0x1e36, /* Ḹ */ 0x1e38,
      /* Ḻ */ 0x1e3a, /* Ḽ */ 0x1e3c, /* Ⓛ */ 0x24c1, /* Ⱡ */ 0x2c60,
      /* Ɫ */ 0x2c62, /* Ꝇ */ 0xa746, /* Ꝉ */ 0xa748, /* Ꞁ */ 0xa780,
      /* Ｌ */ 0xff2c,
    ],
  ],
  [[/* L */ 0x004c, /* J */ 0x004a], [/* Ǉ */ 0x01c7]],
  [[/* L */ 0x004c, /* j */ 0x006a], [/* ǈ */ 0x01c8]],
  [
    [/* M */ 0x004d],
    [
      /* Ɯ */ 0x019c, /* ϻ */ 0x03fb, /* Ḿ */ 0x1e3e, /* Ṁ */ 0x1e40,
      /* Ṃ */ 0x1e42, /* Ⓜ */ 0x24c2, /* Ɱ */ 0x2c6e, /* Ｍ */ 0xff2d,
    ],
  ],
  [
    [/* N */ 0x004e],
    [
      /* Ñ */ 0x00d1, /* Ń */ 0x0143, /* Ņ */ 0x0145, /* Ň */ 0x0147,
      /* Ɲ */ 0x019d, /* Ǹ */ 0x01f8, /* Ƞ */ 0x0220, /* ᴎ */ 0x1d0e,
      /* Ṅ */ 0x1e44, /* Ṇ */ 0x1e46, /* Ṉ */ 0x1e48, /* Ṋ */ 0x1e4a,
      /* Ⓝ */ 0x24c3, /* Ꞑ */ 0xa790, /* Ꞥ */ 0xa7a4, /* Ｎ */ 0xff2e,
    ],
  ],
  [[/* N */ 0x004e, /* J */ 0x004a], [/* Ǌ */ 0x01ca]],
  [[/* N */ 0x004e, /* j */ 0x006a], [/* ǋ */ 0x01cb]],
  [
    [/* O */ 0x004f],
    [
      /* Ò */ 0x00d2, /* Ó */ 0x00d3, /* Ô */ 0x00d4, /* Õ */ 0x00d5,
      /* Ö */ 0x00d6, /* Ø */ 0x00d8, /* Ō */ 0x014c, /* Ŏ */ 0x014e,
      /* Ő */ 0x0150, /* Ɔ */ 0x0186, /* Ɵ */ 0x019f, /* Ơ */ 0x01a0,
      /* Ǒ */ 0x01d1, /* Ǫ */ 0x01ea, /* Ǭ */ 0x01ec, /* Ǿ */ 0x01fe,
      /* Ȍ */ 0x020c, /* Ȏ */ 0x020e, /* Ȫ */ 0x022a, /* Ȭ */ 0x022c,
      /* Ȯ */ 0x022e, /* Ȱ */ 0x0230, /* Ṍ */ 0x1e4c, /* Ṏ */ 0x1e4e,
      /* Ṑ */ 0x1e50, /* Ṓ */ 0x1e52, /* Ọ */ 0x1ecc, /* Ỏ */ 0x1ece,
      /* Ố */ 0x1ed0, /* Ồ */ 0x1ed2, /* Ổ */ 0x1ed4, /* Ỗ */ 0x1ed6,
      /* Ộ */ 0x1ed8, /* Ớ */ 0x1eda, /* Ờ */ 0x1edc, /* Ở */ 0x1ede,
      /* Ỡ */ 0x1ee0, /* Ợ */ 0x1ee2, /* Ⓞ */ 0x24c4, /* Ꝋ */ 0xa74a,
      /* Ꝍ */ 0xa74c, /* Ｏ */ 0xff2f,
    ],
  ],
  [[/* O */ 0x004f, /* E */ 0x0045], [/* Œ */ 0x0152]],
  [[/* O */ 0x004f, /* I */ 0x0049], [/* Ƣ */ 0x01a2]],
  [[/* O */ 0x004f, /* O */ 0x004f], [/* Ꝏ */ 0xa74e]],
  [[/* O */ 0x004f, /* U */ 0x0055], [/* Ȣ */ 0x0222]],
  [
    [/* P */ 0x0050],
    [
      /* Ƥ */ 0x01a4, /* Ṕ */ 0x1e54, /* Ṗ */ 0x1e56, /* Ⓟ */ 0x24c5,
      /* Ᵽ */ 0x2c63, /* Ꝑ */ 0xa750, /* Ꝓ */ 0xa752, /* Ꝕ */ 0xa754,
      /* Ｐ */ 0xff30,
    ],
  ],
  [
    [/* Q */ 0x0051],
    [
      /* Ɋ */ 0x024a, /* Ⓠ */ 0x24c6, /* Ꝗ */ 0xa756, /* Ꝙ */ 0xa758,
      /* Ｑ */ 0xff31,
    ],
  ],
  [
    [/* R */ 0x0052],
    [
      /* Ŕ */ 0x0154, /* Ŗ */ 0x0156, /* Ř */ 0x0158, /* Ȑ */ 0x0210,
      /* Ȓ */ 0x0212, /* Ɍ */ 0x024c, /* Ṙ */ 0x1e58, /* Ṛ */ 0x1e5a,
      /* Ṝ */ 0x1e5c, /* Ṟ */ 0x1e5e, /* Ⓡ */ 0x24c7, /* Ɽ */ 0x2c64,
      /* Ꝛ */ 0xa75a, /* Ꞃ */ 0xa782, /* Ꞧ */ 0xa7a6, /* Ｒ */ 0xff32,
    ],
  ],
  [
    [/* S */ 0x0053],
    [
      /* Ś */ 0x015a, /* Ŝ */ 0x015c, /* Ş */ 0x015e, /* Š */ 0x0160,
      /* Ș */ 0x0218, /* Ṡ */ 0x1e60, /* Ṣ */ 0x1e62, /* Ṥ */ 0x1e64,
      /* Ṧ */ 0x1e66, /* Ṩ */ 0x1e68, /* ẞ */ 0x1e9e, /* Ⓢ */ 0x24c8,
      /* Ȿ */ 0x2c7e, /* Ꞅ */ 0xa784, /* Ꞩ */ 0xa7a8, /* Ｓ */ 0xff33,
    ],
  ],
  [
    [/* T */ 0x0054],
    [
      /* Ţ */ 0x0162, /* Ť */ 0x0164, /* Ŧ */ 0x0166, /* Ƭ */ 0x01ac,
      /* Ʈ */ 0x01ae, /* Ț */ 0x021a, /* Ⱦ */ 0x023e, /* Ṫ */ 0x1e6a,
      /* Ṭ */ 0x1e6c, /* Ṯ */ 0x1e6e, /* Ṱ */ 0x1e70, /* Ⓣ */ 0x24c9,
      /* Ꞇ */ 0xa786, /* Ｔ */ 0xff34,
    ],
  ],
  [[/* T */ 0x0054, /* Z */ 0x005a], [/* Ꜩ */ 0xa728]],
  [[/* T */ 0x0054, /* h */ 0x0068], [/* Þ */ 0x00de]],
  [
    [/* U */ 0x0055],
    [
      /* Ù */ 0x00d9, /* Ú */ 0x00da, /* Û */ 0x00db, /* Ü */ 0x00dc,
      /* Ũ */ 0x0168, /* Ū */ 0x016a, /* Ŭ */ 0x016c, /* Ů */ 0x016e,
      /* Ű */ 0x0170, /* Ų */ 0x0172, /* Ư */ 0x01af, /* Ǔ */ 0x01d3,
      /* Ǖ */ 0x01d5, /* Ǘ */ 0x01d7, /* Ǚ */ 0x01d9, /* Ǜ */ 0x01db,
      /* Ȕ */ 0x0214, /* Ȗ */ 0x0216, /* Ʉ */ 0x0244, /* Ṳ */ 0x1e72,
      /* Ṵ */ 0x1e74, /* Ṷ */ 0x1e76, /* Ṹ */ 0x1e78, /* Ṻ */ 0x1e7a,
      /* Ụ */ 0x1ee4, /* Ủ */ 0x1ee6, /* Ứ */ 0x1ee8, /* Ừ */ 0x1eea,
      /* Ử */ 0x1eec, /* Ữ */ 0x1eee, /* Ự */ 0x1ef0, /* Ⓤ */ 0x24ca,
      /* Ｕ */ 0xff35,
    ],
  ],
  [
    [/* V */ 0x0056],
    [
      /* Ʋ */ 0x01b2, /* Ʌ */ 0x0245, /* Ṽ */ 0x1e7c, /* Ṿ */ 0x1e7e,
      /* Ⓥ */ 0x24cb, /* Ꝟ */ 0xa75e, /* Ｖ */ 0xff36,
    ],
  ],
  [[/* V */ 0x0056, /* Y */ 0x0059], [/* Ꝡ */ 0xa760]],
  [
    [/* W */ 0x0057],
    [
      /* Ŵ */ 0x0174, /* Ẁ */ 0x1e80, /* Ẃ */ 0x1e82, /* Ẅ */ 0x1e84,
      /* Ẇ */ 0x1e86, /* Ẉ */ 0x1e88, /* Ⓦ */ 0x24cc, /* Ⱳ */ 0x2c72,
      /* Ｗ */ 0xff37,
    ],
  ],
  [
    [/* X */ 0x0058],
    [/* Ẋ */ 0x1e8a, /* Ẍ */ 0x1e8c, /* Ⓧ */ 0x24cd, /* Ｘ */ 0xff38],
  ],
  [
    [/* Y */ 0x0059],
    [
      /* Ý */ 0x00dd, /* Ŷ */ 0x0176, /* Ÿ */ 0x0178, /* Ƴ */ 0x01b3,
      /* Ȳ */ 0x0232, /* Ɏ */ 0x024e, /* Ẏ */ 0x1e8e, /* Ỳ */ 0x1ef2,
      /* Ỵ */ 0x1ef4, /* Ỷ */ 0x1ef6, /* Ỹ */ 0x1ef8, /* Ỿ */ 0x1efe,
      /* Ⓨ */ 0x24ce, /* Ｙ */ 0xff39,
    ],
  ],
  [
    [/* Z */ 0x005a],
    [
      /* Ź */ 0x0179, /* Ż */ 0x017b, /* Ž */ 0x017d, /* Ƶ */ 0x01b5,
      /* Ȥ */ 0x0224, /* Ẑ */ 0x1e90, /* Ẓ */ 0x1e92, /* Ẕ */ 0x1e94,
      /* Ⓩ */ 0x24cf, /* Ⱬ */ 0x2c6b, /* Ɀ */ 0x2c7f, /* Ꝣ */ 0xa762,
      /* Ｚ */ 0xff3a,
    ],
  ],
  [
    [/* a */ 0x0061],
    [
      /* à */ 0x00e0, /* á */ 0x00e1, /* â */ 0x00e2, /* ã */ 0x00e3,
      /* ä */ 0x00e4, /* å */ 0x00e5, /* ā */ 0x0101, /* ă */ 0x0103,
      /* ą */ 0x0105, /* ǎ */ 0x01ce, /* ǟ */ 0x01df, /* ǡ */ 0x01e1,
      /* ǻ */ 0x01fb, /* ȁ */ 0x0201, /* ȃ */ 0x0203, /* ȧ */ 0x0227,
      /* ɐ */ 0x0250, /* ɑ */ 0x0251, /* ḁ */ 0x1e01, /* ẚ */ 0x1e9a,
      /* ạ */ 0x1ea1, /* ả */ 0x1ea3, /* ấ */ 0x1ea5, /* ầ */ 0x1ea7,
      /* ẩ */ 0x1ea9, /* ẫ */ 0x1eab, /* ậ */ 0x1ead, /* ắ */ 0x1eaf,
      /* ằ */ 0x1eb1, /* ẳ */ 0x1eb3, /* ẵ */ 0x1eb5, /* ặ */ 0x1eb7,
      /* ⓐ */ 0x24d0, /* ⱥ */ 0x2c65, /* ａ */ 0xff41,
    ],
  ],
  [[/* a */ 0x0061, /* a */ 0x0061], [/* ꜳ */ 0xa733]],
  [
    [/* a */ 0x0061, /* e */ 0x0065],
    [/* æ */ 0x00e6, /* ǣ */ 0x01e3, /* ǽ */ 0x01fd],
  ],
  [[/* a */ 0x0061, /* o */ 0x006f], [/* ꜵ */ 0xa735]],
  [[/* a */ 0x0061, /* u */ 0x0075], [/* ꜷ */ 0xa737]],
  [
    [/* a */ 0x0061, /* v */ 0x0076],
    [/* ꜹ */ 0xa739, /* ꜻ */ 0xa73b],
  ],
  [[/* a */ 0x0061, /* y */ 0x0079], [/* ꜽ */ 0xa73d]],
  [
    [/* b */ 0x0062],
    [
      /* ƀ */ 0x0180, /* Ƃ */ 0x0182, /* ƃ */ 0x0183, /* ɓ */ 0x0253,
      /* ḃ */ 0x1e03, /* ḅ */ 0x1e05, /* ḇ */ 0x1e07, /* ⓑ */ 0x24d1,
      /* ｂ */ 0xff42,
    ],
  ],
  [
    [/* c */ 0x0063],
    [
      /* ç */ 0x00e7, /* ć */ 0x0107, /* ĉ */ 0x0109, /* ċ */ 0x010b,
      /* č */ 0x010d, /* ƈ */ 0x0188, /* ȼ */ 0x023c, /* ḉ */ 0x1e09,
      /* ↄ */ 0x2184, /* ⓒ */ 0x24d2, /* ꜿ */ 0xa73f, /* ｃ */ 0xff43,
    ],
  ],
  [
    [/* d */ 0x0064],
    [
      /* ď */ 0x010f, /* đ */ 0x0111, /* Ƌ */ 0x018b, /* ƌ */ 0x018c,
      /* ɖ */ 0x0256, /* ɗ */ 0x0257, /* ԁ */ 0x0501, /* Ꮷ */ 0x13e7,
      /* ḋ */ 0x1e0b, /* ḍ */ 0x1e0d, /* ḏ */ 0x1e0f, /* ḑ */ 0x1e11,
      /* ḓ */ 0x1e13, /* ⓓ */ 0x24d3, /* Ɦ */ 0xa7aa, /* ｄ */ 0xff44,
    ],
  ],
  [[/* d */ 0x0064, /* h */ 0x0068], [/* ð */ 0x00f0]],
  [
    [/* d */ 0x0064, /* z */ 0x007a],
    [/* ǆ */ 0x01c6, /* ǳ */ 0x01f3],
  ],
  [
    [/* e */ 0x0065],
    [
      /* è */ 0x00e8, /* é */ 0x00e9, /* ê */ 0x00ea, /* ë */ 0x00eb,
      /* ē */ 0x0113, /* ĕ */ 0x0115, /* ė */ 0x0117, /* ę */ 0x0119,
      /* ě */ 0x011b, /* ǝ */ 0x01dd, /* ȅ */ 0x0205, /* ȇ */ 0x0207,
      /* ȩ */ 0x0229, /* ɇ */ 0x0247, /* ḕ */ 0x1e15, /* ḗ */ 0x1e17,
      /* ḙ */ 0x1e19, /* ḛ */ 0x1e1b, /* ḝ */ 0x1e1d, /* ẹ */ 0x1eb9,
      /* ẻ */ 0x1ebb, /* ẽ */ 0x1ebd, /* ế */ 0x1ebf, /* ề */ 0x1ec1,
      /* ể */ 0x1ec3, /* ễ */ 0x1ec5, /* ệ */ 0x1ec7, /* ⓔ */ 0x24d4,
      /* ｅ */ 0xff45,
    ],
  ],
  [
    [/* f */ 0x0066],
    [/* ƒ */ 0x0192, /* ḟ */ 0x1e1f, /* ⓕ */ 0x24d5, /* ｆ */ 0xff46],
  ],
  [[/* f */ 0x0066, /* f */ 0x0066], [/* ﬀ */ 0xfb00]],
  [[/* f */ 0x0066, /* f */ 0x0066, /* i */ 0x0069], [/* ﬃ */ 0xfb03]],
  [[/* f */ 0x0066, /* f */ 0x0066, /* l */ 0x006c], [/* ﬄ */ 0xfb04]],
  [[/* f */ 0x0066, /* i */ 0x0069], [/* ﬁ */ 0xfb01]],
  [[/* f */ 0x0066, /* l */ 0x006c], [/* ﬂ */ 0xfb02]],
  [
    [/* g */ 0x0067],
    [
      /* ĝ */ 0x011d, /* ğ */ 0x011f, /* ġ */ 0x0121, /* ģ */ 0x0123,
      /* ǥ */ 0x01e5, /* ǧ */ 0x01e7, /* ǵ */ 0x01f5, /* ɠ */ 0x0260,
      /* ᵹ */ 0x1d79, /* ḡ */ 0x1e21, /* ⓖ */ 0x24d6, /* ꝿ */ 0xa77f,
      /* ꞡ */ 0xa7a1, /* ｇ */ 0xff47,
    ],
  ],
  [
    [/* h */ 0x0068],
    [
      /* ĥ */ 0x0125, /* ħ */ 0x0127, /* ȟ */ 0x021f, /* ɥ */ 0x0265,
      /* ḣ */ 0x1e23, /* ḥ */ 0x1e25, /* ḧ */ 0x1e27, /* ḩ */ 0x1e29,
      /* ḫ */ 0x1e2b, /* ẖ */ 0x1e96, /* ⓗ */ 0x24d7, /* ⱨ */ 0x2c68,
      /* ⱶ */ 0x2c76, /* ｈ */ 0xff48,
    ],
  ],
  [[/* h */ 0x0068, /* v */ 0x0076], [/* ƕ */ 0x0195]],
  [
    [/* i */ 0x0069],
    [
      /* ì */ 0x00ec, /* í */ 0x00ed, /* î */ 0x00ee, /* ï */ 0x00ef,
      /* ĩ */ 0x0129, /* ī */ 0x012b, /* ĭ */ 0x012d, /* į */ 0x012f,
      /* ı */ 0x0131, /* ǐ */ 0x01d0, /* ȉ */ 0x0209, /* ȋ */ 0x020b,
      /* ɨ */ 0x0268, /* ḭ */ 0x1e2d, /* ḯ */ 0x1e2f, /* ỉ */ 0x1ec9,
      /* ị */ 0x1ecb, /* ⓘ */ 0x24d8, /* ｉ */ 0xff49,
    ],
  ],
  [
    [/* j */ 0x006a],
    [
      /* ĵ */ 0x0135, /* ǰ */ 0x01f0, /* ɉ */ 0x0249, /* ⓙ */ 0x24d9,
      /* ｊ */ 0xff4a,
    ],
  ],
  [
    [/* k */ 0x006b],
    [
      /* ķ */ 0x0137, /* ƙ */ 0x0199, /* ǩ */ 0x01e9, /* ḱ */ 0x1e31,
      /* ḳ */ 0x1e33, /* ḵ */ 0x1e35, /* ⓚ */ 0x24da, /* ⱪ */ 0x2c6a,
      /* ꝁ */ 0xa741, /* ꝃ */ 0xa743, /* ꝅ */ 0xa745, /* ꞣ */ 0xa7a3,
      /* ｋ */ 0xff4b,
    ],
  ],
  [
    [/* l */ 0x006c],
    [
      /* ĺ */ 0x013a, /* ļ */ 0x013c, /* ľ */ 0x013e, /* ŀ */ 0x0140,
      /* ł */ 0x0142, /* ſ */ 0x017f, /* ƚ */ 0x019a, /* ɫ */ 0x026b,
      /* ɭ */ 0x026d, /* ḷ */ 0x1e37, /* ḹ */ 0x1e39, /* ḻ */ 0x1e3b,
      /* ḽ */ 0x1e3d, /* ⓛ */ 0x24db, /* ⱡ */ 0x2c61, /* ꝇ */ 0xa747,
      /* ꝉ */ 0xa749, /* ꞁ */ 0xa781, /* ｌ */ 0xff4c,
    ],
  ],
  [[/* l */ 0x006c, /* j */ 0x006a], [/* ǉ */ 0x01c9]],
  [
    [/* m */ 0x006d],
    [
      /* ɯ */ 0x026f, /* ɱ */ 0x0271, /* ḿ */ 0x1e3f, /* ṁ */ 0x1e41,
      /* ṃ */ 0x1e43, /* ⓜ */ 0x24dc, /* ｍ */ 0xff4d,
    ],
  ],
  [
    [/* n */ 0x006e],
    [
      /* ñ */ 0x00f1, /* ń */ 0x0144, /* ņ */ 0x0146, /* ň */ 0x0148,
      /* ŉ */ 0x0149, /* ƞ */ 0x019e, /* ǹ */ 0x01f9, /* ɲ */ 0x0272,
      /* л */ 0x043b, /* ԉ */ 0x0509, /* ṅ */ 0x1e45, /* ṇ */ 0x1e47,
      /* ṉ */ 0x1e49, /* ṋ */ 0x1e4b, /* ⓝ */ 0x24dd, /* ꞑ */ 0xa791,
      /* ꞥ */ 0xa7a5, /* ｎ */ 0xff4e,
    ],
  ],
  [[/* n */ 0x006e, /* j */ 0x006a], [/* ǌ */ 0x01cc]],
  [
    [/* o */ 0x006f],
    [
      /* ò */ 0x00f2, /* ó */ 0x00f3, /* ô */ 0x00f4, /* õ */ 0x00f5,
      /* ö */ 0x00f6, /* ø */ 0x00f8, /* ō */ 0x014d, /* ŏ */ 0x014f,
      /* ő */ 0x0151, /* ơ */ 0x01a1, /* ǒ */ 0x01d2, /* ǫ */ 0x01eb,
      /* ǭ */ 0x01ed, /* ǿ */ 0x01ff, /* ȍ */ 0x020d, /* ȏ */ 0x020f,
      /* ȫ */ 0x022b, /* ȭ */ 0x022d, /* ȯ */ 0x022f, /* ȱ */ 0x0231,
      /* ɔ */ 0x0254, /* ɵ */ 0x0275, /* ᴑ */ 0x1d11, /* ṍ */ 0x1e4d,
      /* ṏ */ 0x1e4f, /* ṑ */ 0x1e51, /* ṓ */ 0x1e53, /* ọ */ 0x1ecd,
      /* ỏ */ 0x1ecf, /* ố */ 0x1ed1, /* ồ */ 0x1ed3, /* ổ */ 0x1ed5,
      /* ỗ */ 0x1ed7, /* ộ */ 0x1ed9, /* ớ */ 0x1edb, /* ờ */ 0x1edd,
      /* ở */ 0x1edf, /* ỡ */ 0x1ee1, /* ợ */ 0x1ee3, /* ⓞ */ 0x24de,
      /* ꝋ */ 0xa74b, /* ꝍ */ 0xa74d, /* ｏ */ 0xff4f,
    ],
  ],
  [[/* o */ 0x006f, /* e */ 0x0065], [/* œ */ 0x0153]],
  [[/* o */ 0x006f, /* i */ 0x0069], [/* ƣ */ 0x01a3]],
  [[/* o */ 0x006f, /* o */ 0x006f], [/* ꝏ */ 0xa74f]],
  [[/* o */ 0x006f, /* u */ 0x0075], [/* ȣ */ 0x0223]],
  [
    [/* p */ 0x0070],
    [
      /* ƥ */ 0x01a5, /* ρ */ 0x03c1, /* ᵽ */ 0x1d7d, /* ṕ */ 0x1e55,
      /* ṗ */ 0x1e57, /* ⓟ */ 0x24df, /* ꝑ */ 0xa751, /* ꝓ */ 0xa753,
      /* ꝕ */ 0xa755, /* ｐ */ 0xff50,
    ],
  ],
  [
    [/* q */ 0x0071],
    [
      /* ɋ */ 0x024b, /* ⓠ */ 0x24e0, /* ꝗ */ 0xa757, /* ꝙ */ 0xa759,
      /* ｑ */ 0xff51,
    ],
  ],
  [
    [/* r */ 0x0072],
    [
      /* ŕ */ 0x0155, /* ŗ */ 0x0157, /* ř */ 0x0159, /* ȑ */ 0x0211,
      /* ȓ */ 0x0213, /* ɍ */ 0x024d, /* ɽ */ 0x027d, /* ṙ */ 0x1e59,
      /* ṛ */ 0x1e5b, /* ṝ */ 0x1e5d, /* ṟ */ 0x1e5f, /* ⓡ */ 0x24e1,
      /* ꝛ */ 0xa75b, /* ꞃ */ 0xa783, /* ꞧ */ 0xa7a7, /* ｒ */ 0xff52,
    ],
  ],
  [
    [/* s */ 0x0073],
    [
      /* ś */ 0x015b, /* ŝ */ 0x015d, /* ş */ 0x015f, /* š */ 0x0161,
      /* ș */ 0x0219, /* ȿ */ 0x023f, /* ʂ */ 0x0282, /* ṡ */ 0x1e61,
      /* ṣ */ 0x1e63, /* ṥ */ 0x1e65, /* ṧ */ 0x1e67, /* ṩ */ 0x1e69,
      /* ẛ */ 0x1e9b, /* ⓢ */ 0x24e2, /* ꞅ */ 0xa785, /* ꞩ */ 0xa7a9,
      /* ｓ */ 0xff53,
    ],
  ],
  [[/* s */ 0x0073, /* s */ 0x0073], [/* ß */ 0x00df]],
  [
    [/* t */ 0x0074],
    [
      /* ţ */ 0x0163, /* ť */ 0x0165, /* ŧ */ 0x0167, /* ƭ */ 0x01ad,
      /* ț */ 0x021b, /* ʈ */ 0x0288, /* ṫ */ 0x1e6b, /* ṭ */ 0x1e6d,
      /* ṯ */ 0x1e6f, /* ṱ */ 0x1e71, /* ẗ */ 0x1e97, /* ⓣ */ 0x24e3,
      /* ⱦ */ 0x2c66, /* ꞇ */ 0xa787, /* ｔ */ 0xff54,
    ],
  ],
  [[/* t */ 0x0074, /* h */ 0x0068], [/* þ */ 0x00fe]],
  [[/* t */ 0x0074, /* z */ 0x007a], [/* ꜩ */ 0xa729]],
  [
    [/* u */ 0x0075],
    [
      /* ù */ 0x00f9, /* ú */ 0x00fa, /* û */ 0x00fb, /* ü */ 0x00fc,
      /* ũ */ 0x0169, /* ū */ 0x016b, /* ŭ */ 0x016d, /* ů */ 0x016f,
      /* ű */ 0x0171, /* ų */ 0x0173, /* ư */ 0x01b0, /* ǔ */ 0x01d4,
      /* ǖ */ 0x01d6, /* ǘ */ 0x01d8, /* ǚ */ 0x01da, /* ǜ */ 0x01dc,
      /* ȕ */ 0x0215, /* ȗ */ 0x0217, /* ʉ */ 0x0289, /* ṳ */ 0x1e73,
      /* ṵ */ 0x1e75, /* ṷ */ 0x1e77, /* ṹ */ 0x1e79, /* ṻ */ 0x1e7b,
      /* ụ */ 0x1ee5, /* ủ */ 0x1ee7, /* ứ */ 0x1ee9, /* ừ */ 0x1eeb,
      /* ử */ 0x1eed, /* ữ */ 0x1eef, /* ự */ 0x1ef1, /* ⓤ */ 0x24e4,
      /* ｕ */ 0xff55,
    ],
  ],
  [
    [/* v */ 0x0076],
    [
      /* ʋ */ 0x028b, /* ʌ */ 0x028c, /* ṽ */ 0x1e7d, /* ṿ */ 0x1e7f,
      /* ⓥ */ 0x24e5, /* ꝟ */ 0xa75f, /* ｖ */ 0xff56,
    ],
  ],
  [[/* v */ 0x0076, /* y */ 0x0079], [/* ꝡ */ 0xa761]],
  [
    [/* w */ 0x0077],
    [
      /* ŵ */ 0x0175, /* ẁ */ 0x1e81, /* ẃ */ 0x1e83, /* ẅ */ 0x1e85,
      /* ẇ */ 0x1e87, /* ẉ */ 0x1e89, /* ẘ */ 0x1e98, /* ⓦ */ 0x24e6,
      /* ⱳ */ 0x2c73, /* ｗ */ 0xff57,
    ],
  ],
  [
    [/* x */ 0x0078],
    [/* ẋ */ 0x1e8b, /* ẍ */ 0x1e8d, /* ⓧ */ 0x24e7, /* ｘ */ 0xff58],
  ],
  [
    [/* y */ 0x0079],
    [
      /* ý */ 0x00fd, /* ÿ */ 0x00ff, /* ŷ */ 0x0177, /* ƴ */ 0x01b4,
      /* ȳ */ 0x0233, /* ɏ */ 0x024f, /* ẏ */ 0x1e8f, /* ẙ */ 0x1e99,
      /* ỳ */ 0x1ef3, /* ỵ */ 0x1ef5, /* ỷ */ 0x1ef7, /* ỹ */ 0x1ef9,
      /* ỿ */ 0x1eff, /* ⓨ */ 0x24e8, /* ｙ */ 0xff59,
    ],
  ],
  [
    [/* z */ 0x007a],
    [
      /* ź */ 0x017a, /* ż */ 0x017c, /* ž */ 0x017e, /* ƶ */ 0x01b6,
      /* ȥ */ 0x0225, /* ɀ */ 0x0240, /* ẑ */ 0x1e91, /* ẓ */ 0x1e93,
      /* ẕ */ 0x1e95, /* ⓩ */ 0x24e9, /* ⱬ */ 0x2c6c, /* ꝣ */ 0xa763,
      /* ｚ */ 0xff5a,
    ],
  ],
] as [to: CodePoint[], from: CodePoint[]][];

const basicLetters = new Map<CodePoint, readonly CodePoint[]>();

for (const [to, from] of basicLettersData) {
  for (const codePoint of from) {
    basicLetters.set(codePoint, to);
  }
}

const basicPunctuationData = [
  [
    0x0021, // Exclamation Mark
    [
      0x00a1, // Inverted Exclamation Mark
    ],
  ],
  [
    0x0022, // Quotation Mark
    [
      0x00ab, // Left-Pointing Double Angle Quotation Mark
      0x00bb, // Right-Pointing Double Angle Quotation Mark
      0x201c, // Left Double Quotation Mark
      0x201d, // Right Double Quotation Mark
      0x201e, // Double Low-9 Quotation Mark
      0x201f, // Double High-Reversed-9 Quotation Mark
      0x2039, // Single Left-Pointing Angle Quotation Mark
      0x203a, // Single Right-Pointing Angle Quotation Mark
    ],
  ],
  [
    0x0027, // Apostrophe
    [
      0x2018, // Left Single Quotation Mark
      0x2019, // Right Single Quotation Mark
    ],
  ],
  [
    0x002d, // Hyphen-Minus
    [
      0x2010, // Hyphen
      0x2011, // Non-Breaking Hyphen
      0x2012, // Figure Dash
      0x2013, // En Dash
      0x2014, // Em Dash
    ],
  ],
  [
    0x003f, // Question Mark
    [
      0x00bf, // Inverted Question Mark
    ],
  ],
] as [to: CodePoint, from: CodePoint[]][];

const basicPunctuation = new Map<CodePoint, CodePoint>();

for (const [to, from] of basicPunctuationData) {
  for (const codePoint of from) {
    basicPunctuation.set(codePoint, to);
  }
}

/**
 * Removes any illegal characters from the specified text, collapses whitespace.
 */
export function filterText(text: string, set: CodePointSet): string {
  let result = "";
  let ws = "";

  const append = (
    codePoint: CodePoint,
    s = String.fromCodePoint(codePoint),
  ) => {
    if (set.has(codePoint)) {
      if (ws !== "") {
        result += ws;
        ws = "";
      }
      result += s;
      return true;
    }
    return false;
  };

  const space = (char: string) => {
    if (result !== "" && ws !== "\n") {
      ws = char;
    }
  };

  for (let codePoint of toCodePoints(text.normalize())) {
    if (isLinebreak(codePoint)) {
      space("\n");
      continue;
    }
    if (isWhitespace(codePoint)) {
      space(" ");
      continue;
    }
    if (isControl(codePoint)) {
      space(" ");
      continue;
    }
    if (isDiacritic(codePoint)) {
      continue;
    }
    switch (codePoint) {
      case 0x2026: // Horizontal Ellipsis
        if (!append(/* . */ 0x002e, "...")) {
          space(" ");
        }
        continue;
      case 0x2047: // Double Question Mark
        if (!append(/* ? */ 0x003f) && !append(/* ? */ 0x003f)) {
          space(" ");
        }
        continue;
      case 0x2048: // Question Exclamation Mark
        if (!append(/* ? */ 0x003f) && !append(/* ! */ 0x0021)) {
          space(" ");
        }
        continue;
    }
    if (!append(codePoint)) {
      const a = basicPunctuation.get(codePoint);
      if (a != null) {
        if (!append(a, String.fromCodePoint(codePoint))) {
          space(" ");
        }
        continue;
      }
      const b = basicLetters.get(codePoint);
      if (b != null) {
        for (const letter of b) {
          append(letter);
        }
        continue;
      }
      space(" ");
    }
  }
  return result;
}

filterText.normalize = normalize;

function normalize(codePoint: CodePoint): CodePoint {
  return basicPunctuation.get(codePoint) ?? codePoint;
}
